darklykuma/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 默认模板只保留 NVS、PHY data 和占用剩余空间的 factory app；用户可按需修改。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# FOG MARCH 中文 UI:内置思源黑体简体子集(Plan A,PRD 10.4)。字形覆盖须逐字
# 核对(用 lv_font_get_glyph_dsc 按码点检查)并经真机验收,见 PRD 17.4。
CONFIG_LV_TXT_ENC_UTF8=y
CONFIG_LV_USE_FONT_PLACEHOLDER=y
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK=y
# LVGL 内置 malloc 池(KB)。战场页约 170 个对象(80 地块 + 80 单位层 + 标签),
# 24KB 不足;按对象预算上调至 48KB(PRD 15.2 内存以实测为准)。
CONFIG_LV_MEM_SIZE_KILOBYTES=48

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# FOG MARCH 不使用任何蓝牙功能(PRD 15.2):关闭 NimBLE 回收 RAM。
# 基线 demo_ble.c 已随测试菜单一并移出本应用的编译列表。
CONFIG_BT_ENABLED=n
